Load_Outputs/scenario1/300-100/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
01 Homepage,400,111,101,127,197,304,81,334,0.000%,1.05242,2.61,0.27
02 Stats API,400,6055,5825,10518,10660,10791,193,10909,35.500%,1.02342,0.85,0.28
03 Search API (keyword search),400,6291,6143,10182,10314,10376,257,10506,40.250%,.99689,16.85,0.31
04 Salary API (shown alongside search results),400,6371,6566,10205,10309,10523,106,10563,39.500%,.98523,0.83,0.28
05 Search API Filtered By Location,400,6224,5879,10074,10189,10272,384,10309,37.000%,.97655,24.38,0.32
06 Job Describe API,400,5446,5091,9817,9944,10056,54,10079,31.250%,.97637,1.00,0.39
07 Similar Jobs API,400,4836,4381,9734,9916,10041,51,10067,27.250%,.97734,0.75,0.40
08 Subscribe API,400,2454,60,206,30002,30004,51,30017,97.500%,.97998,0.95,0.49
TOTAL,3200,4724,4125,10059,10272,10819,51,30017,38.531%,7.67371,46.80,2.66