Load_Outputs/scenario1/round3/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
01 Homepage,300,105,100,119,134,207,83,341,0.000%,2.99907,7.43,0.76
02 Stats API,300,60,57,65,76,134,49,251,0.000%,2.99832,2.49,0.83
03 Search API (keyword search),300,2813,2911,4226,4442,4719,235,5079,0.000%,2.84803,76.48,0.89
04 Salary API (shown alongside search results),300,3128,3124,4852,5295,5717,85,6087,0.000%,2.80287,2.38,0.80
05 Search API Filtered By Location,300,2754,2747,4174,4414,4797,304,7022,0.000%,2.78443,81.69,0.92
06 Job Describe API,300,1862,1958,3222,3434,3741,54,4088,0.000%,2.78226,2.96,1.15
07 Similar Jobs API,300,1739,1784,3250,3538,3949,52,4307,0.000%,2.76544,2.12,1.18
08 Subscribe API,300,1202,55,87,3862,30017,49,30019,96.667%,2.77205,2.41,1.45
TOTAL,2400,1708,1340,3874,4345,5514,49,30019,12.083%,20.95411,165.15,7.39